app/controllers/body_mass_controller.rb

UPDATE "body_masses" SET "mass" = ?, "height" = ?, "imc" = ?, "category" = ?, "updated_at" = ? WHERE "body_masses"."id" = ?  [["mass", 100.0], ["height", 1.45], ["imc", 47.56], ["category", "Obese Class III (Very severely obese)"], ["updated_at", 2017-03-26 00:22:39 UTC], ["id", 4]]
---
  def update
    @body_mass.update(body_mass_params)