app/controllers/body_mass_controller.rb

SELECT  "body_masses".* FROM "body_masses" WHERE "body_masses"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
---
  def index
    @body_mass = BodyMass.find_by(user_id: current_user.id)